In [4]:
# Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [59]:
# Turn the project folder path into a string 
path = r'C:\Users\Kalyani\Documents\Instacart_Basket_Analysis'

In [60]:
path

'C:\\Users\\Kalyani\\Documents\\Instacart_Basket_Analysis'

In [7]:
# mporting "customers.csv” data set from your “Original Data” folder as customers
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original_data', 'customers', 'customers.csv'))

#STEP 4

In [8]:
# Check newly imported dataframe 'customers'
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# Check the number of columns and rows
customers.shape

(206209, 10)

In [10]:
# Check descriptive statistics  
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [11]:
# Ckeck the datatypes
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [12]:
# let's rename the columns header appropriately
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [13]:
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [14]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [15]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [16]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [17]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [18]:
customers.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [19]:
# Columns name has been changed appropriately

In [20]:
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# STEP 5

In [21]:
# check mixed datatypes

In [22]:
customers.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [23]:
#check mixed datatypes
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Kalyani\AppData\Local\Temp\ipykernel_12572\3093127950.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)

In [24]:
# It seems there is 'first_name' column has mixed data type values.

In [25]:
customers['first_name'] = customers['first_name'].astype('str')

In [26]:
# check data types again
customers.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [27]:
# checking missing values
customers.isnull().sum()

user_id           0
first_name        0
last_name         0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [28]:
# There are no missing values presents in the customer dataframe.

In [29]:
# Checking duplicates
customers_dups = customers[customers.duplicated()]

In [30]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [31]:
# There are no missing values nor duplicated values presents in dataframe.

# STEP 6: Combine your customer data with the rest of your prepared Instacart data

In [32]:
# mporting 'ords_prods_grouped.pkl” data set from your “Prepared Data” folder as df_ords_prods_merge
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared_data', 'ords_prods_grouped.pkl'))

In [33]:
# Check the shape of 'ords_prods_merge' dataframe
ords_prods_merge.shape

(32404859, 24)

In [34]:
# Preview of 'ords_prods_merge' dataframe
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,Busiest_day,Busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_of_prices,spender_flag,median_of_days,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non_frequent Customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Slowest days,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non_frequent Customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Slowest days,Most Orders,10,New customer,6.367797,Low Spender,20.5,Non_frequent Customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Slowest days,Average Orders,10,New customer,6.367797,Low Spender,20.5,Non_frequent Customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Slowest days,Most Orders,10,New customer,6.367797,Low Spender,20.5,Non_frequent Customer

In [35]:
# Check datatypes of 'ords_prods_merge'
ords_prods_merge.dtypes

order_id                        int64
user_id                         int64
order_number                    int64
order_day_of_week               int64
order_hour_of_day               int64
days_since_previous_order     float64
product_id                      int64
add_to_cart_order               int64
reordered                       int64
product_name                   object
aisle_id                        int64
department_id                   int64
prices                        float64
_merge                       category
price_range_loc                object
Busiest_day                    object
Busiest_days                   object
busiest_period_of_day          object
max_order                       int64
loyalty_flag                   object
mean_of_prices                float64
spender_flag                   object
median_of_days                float64
frequency_flag                 object
dtype: object

In [36]:
# lets drop '_merge' columns from 'ords_prods_merge' dataframe
ords_prods_merge = ords_prods_merge.drop(columns = [ '_merge'])

In [37]:
# check new columns of 'ords_prods_merge' dataframe
ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_previous_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_day',
       'Busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_of_prices', 'spender_flag', 'median_of_days', 'frequency_flag'],
      dtype='object')

In [38]:
# check the shape of 'otds_prods_merge'
ords_prods_merge.shape

(32404859, 23)

In [39]:
# Lets check shape of 'customers' datag=frame
customers.shape

(206209, 10)

In [40]:
# Preview of customers dataframe
customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [41]:
# Check data types of column
customers.dtypes

user_id            int64
first_name        object
last_name         object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [42]:
# 'ords_prods_merge' dataframe and 'customers' dataframe has the same column 'user_id' with the same data type which will act as a key column.
## Let's join two dataframe on the common column 'user_id'
custs_ords_prods = ords_prods_merge.merge(customers, on = 'user_id', indicator = True)

In [43]:
# Lets check shape for new dataframe
custs_ords_prods.shape

(32404859, 33)

In [44]:
# preview of new dataframe
custs_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,first_name,last_name,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [45]:
custs_ords_prods.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_previous_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_day',
       'Busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_of_prices', 'spender_flag', 'median_of_days', 'frequency_flag',
       'first_name', 'last_name', 'gender', 'state', 'age', 'date_joined',
       'n_dependants', 'marital_status', 'income', '_merge'],
      dtype='object')

In [46]:
custs_ords_prods['_merge']

0           both
1           both
2           both
3           both
4           both
            ...
32404854    both
32404855    both
32404856    both
32404857    both
32404858    both
Name: _merge, Length: 32404859, dtype: category
Categories (3, object): ['left_only', 'right_only', 'both']

In [47]:
custs_ords_prods['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [48]:
# Lets check datatypes of 'custs_ords_prods' dataframe
custs_ords_prods.dtypes

order_id                        int64
user_id                         int64
order_number                    int64
order_day_of_week               int64
order_hour_of_day               int64
days_since_previous_order     float64
product_id                      int64
add_to_cart_order               int64
reordered                       int64
product_name                   object
aisle_id                        int64
department_id                   int64
prices                        float64
price_range_loc                object
Busiest_day                    object
Busiest_days                   object
busiest_period_of_day          object
max_order                       int64
loyalty_flag                   object
mean_of_prices                float64
spender_flag                   object
median_of_days                float64
frequency_flag                 object
first_name                     object
last_name                      object
gender                         object
state                          object
age                             int64
date_joined                    object
n_dependants                    int64
marital_status                 object
income                          int64
_merge                       category
dtype: object

# STEP 8: Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [51]:
custs_ords_prods.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_previous_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_day',
       'Busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_of_prices', 'spender_flag', 'median_of_days', 'frequency_flag',
       'first_name', 'last_name', 'gender', 'state', 'age', 'date_joined',
       'n_dependants', 'marital_status', 'income', '_merge'],
      dtype='object')

In [54]:
custs_ords_prods.drop(['first_name', 'last_name'], axis = 1, inplace = True)

In [55]:
custs_ords_prods.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,median_of_days,frequency_flag,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,20.5,Non_frequent Customer,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,20.5,Non_frequent Customer,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,20.5,Non_frequent Customer,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,20.5,Non_frequent Customer,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,20.5,Non_frequent Customer,Female,Alabama,31,2/17/2019,3,married,40423,both

In [56]:
custs_ords_prods.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_previous_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_day',
       'Busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'mean_of_prices', 'spender_flag', 'median_of_days', 'frequency_flag',
       'gender', 'state', 'age', 'date_joined', 'n_dependants',
       'marital_status', 'income', '_merge'],
      dtype='object')

In [57]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared_data', 'ords_prods_custs_merged.pkl'))